InformationRegisters/сшпРепозиторийОбъектовИнтеграции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>сшпРепозиторийОбъектовИнтеграции</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ДляУдаленияПроцедураОбработки</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПроцедураОбработки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МетодХранения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.сшпМетодХранения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Версия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторШаблона</Name>
					<Comment>Внутренний идентификатор загруженного шаблона</Comment>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>250</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВерсияПеременных</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИмяКлассаОбъекта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипИнтеграции</Name>
					<Type>
						<v8:Type>cfg:EnumRef.сшпТипыИнтеграции</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/сшпСтатусыОбработчиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>сшпСтатусыОбработчиков</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Type>
						<v8:Type>cfg:EnumRef.сшпСтатусыОбработчиков</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДатаИзменения</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>ИдентификаторОбработчика</Name>
					<Type>
						<v8:Type>v8:UUID</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/сшпСтатусыОбработчиков.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>сшпСтатусыОбработчиков</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Включен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отключен</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/сшпРепозиторийОбъектовИнтеграции/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	Заголовок = ТекущийОбъект.Наименование;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Запись.ИдентификаторШаблона) тогда
		текЗапрос = Новый Запрос("ВЫБРАТЬ
		|	тбСостояние.Статус,
		|	тбСостояние.ДатаИзменения
		|ИЗ
		|	РегистрСведений.сшпСтатусыОбработчиков КАК тбСостояние
		|ГДЕ
		|	тбСостояние.ИдентификаторОбработчика = &ИдентификаторОбработчика");
		текЗапрос.УстановитьПараметр("ИдентификаторОбработчика", Запись.ИдентификаторШаблона);
		текВыборка = текЗапрос.Выполнить().Выбрать();
		текВыборка.Следующий();
		
		Статус = текВыборка.Статус;
		СтатусОбработчика = Статус;
		ДатаИзменения = текВыборка.ДатаИзменения;
		
		хэшСуммаОбработчика = сшпКэшируемыеФункции.ПолучитьХэшСумму(Запись.ПроцедураОбработки + Строка(Запись.МетодХранения));
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если НЕ СтатусОбработчика = Статус тогда
		сшпРаботаСДанными.УстановитьСтатусОбработчика(Запись.ИдентификаторШаблона, Статус);
		
		xmlЗапись = Новый ЗаписьXML;
		xmlЗапись.УстановитьСтроку("UTF-8");
		xmlЗапись.ЗаписатьНачалоЭлемента("TemplateState");
		сшпФункцииРаботыXML.СформироватьЭлементXML(xmlЗапись, Запись.ИдентификаторШаблона, "Id");
		сшпФункцииРаботыXML.СформироватьЭлементXML(xmlЗапись, Статус = Перечисления.сшпСтатусыОбработчиков.Включен, "IsStarted");
		xmlЗапись.ЗаписатьКонецЭлемента();
		
		РезультатОбработки = сшпОбщегоНазначения.СформироватьСтруктуруПакета("SSM","Esb-1c-TemplateChangeState", xmlЗапись.Закрыть());
		
		сшпВзаимодействиеСАдаптером.ОтправитьСообщение(РезультатОбработки);
		//xmlПакет = сшпОбщегоНазначения.СериализоватьОбъект(сшпФункциональныеОпции.ФорматСообщения(), РезультатОбработки);
		//сшпРаботаСДанными.ПоместитьВСистемнуюОчередь(Новый УникальныйИдентификатор, сшпФункциональныеОпции.ФорматСообщения(), "SSM", xmlПакет);
	КонецЕсли;	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если НЕ хэшСуммаОбработчика = сшпКэшируемыеФункции.ПолучитьХэшСумму(ТекущийОбъект.ПроцедураОбработки + Строка(ТекущийОбъект.МетодХранения)) тогда
		ТекущийОбъект.Версия = Строка(Число(ТекущийОбъект.Версия) + 1);
	КонецЕсли;	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СтатусПриИзменении(Элемент)
	Если НЕ СтатусОбработчика = Статус тогда
		ДатаИзменения = ПолучитьДатуСеанса();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Функция ПолучитьДатуСеанса()
	Возврат  ТекущаяДатаСеанса();
КонецФункции

#КонецОбласти
